{
  "2105.00813v2": {
    "title": "Transformers: \"The End of History\" for NLP?",
    "authors": [
      "Anton Chernyavskiy",
      "Dmitry Ilvovsky",
      "Preslav Nakov"
    ],
    "summary": "Recent advances in neural architectures, such as the Transformer, coupled with the emergence of large-scale pre-trained models such as BERT, have revolutionized the field of Natural Language Processing (NLP), pushing the state of the art for a number of NLP tasks. A rich family of variations of these models has been proposed, such as RoBERTa, ALBERT, and XLNet, but fundamentally, they all remain limited in their ability to model certain kinds of information, and they cannot cope with certain information sources, which was easy for pre-existing models. Thus, here we aim to shed light on some important theoretical limitations of pre-trained BERT-style models that are inherent in the general Transformer architecture. First, we demonstrate in practice on two general types of tasks -- segmentation and segment labeling -- and on four datasets that these limitations are indeed harmful and that addressing them, even in some very simple and naive ways, can yield sizable improvements over vanilla RoBERTa and XLNet models. Then, we offer a more general discussion on desiderata for future additions to the Transformer architecture that would increase its expressiveness, which we hope could help in the design of the next generation of deep NLP architectures.",
    "pdf_url": "https://arxiv.org/pdf/2105.00813v2",
    "published": "2021-04-09"
  },
  "2104.12405v2": {
    "title": "A dissemination workshop for introducing young Italian students to NLP",
    "authors": [
      "Lucio Messina",
      "Lucia Busso",
      "Claudia Roberta Combei",
      "Ludovica Pannitto",
      "Alessio Miaschi",
      "Gabriele Sarti",
      "Malvina Nissim"
    ],
    "summary": "We describe and make available the game-based material developed for a laboratory run at several Italian science festivals to popularize NLP among young students.",
    "pdf_url": "https://arxiv.org/pdf/2104.12405v2",
    "published": "2021-04-26"
  },
  "2104.12422v2": {
    "title": "Teaching NLP with Bracelets and Restaurant Menus: An Interactive Workshop for Italian Students",
    "authors": [
      "Ludovica Pannitto",
      "Lucia Busso",
      "Claudia Roberta Combei",
      "Lucio Messina",
      "Alessio Miaschi",
      "Gabriele Sarti",
      "Malvina Nissim"
    ],
    "summary": "Although Natural Language Processing (NLP) is at the core of many tools young people use in their everyday life, high school curricula (in Italy) do not include any computational linguistics education. This lack of exposure makes the use of such tools less responsible than it could be and makes choosing computational linguistics as a university degree unlikely. To raise awareness, curiosity, and longer-term interest in young people, we have developed an interactive workshop designed to illustrate the basic principles of NLP and computational linguistics to high school Italian students aged between 13 and 18 years. The workshop takes the form of a game in which participants play the role of machines needing to solve some of the most common problems a computer faces in understanding language: from voice recognition to Markov chains to syntactic parsing. Participants are guided through the workshop with the help of instructors, who present the activities and explain core concepts from computational linguistics. The workshop was presented at numerous outlets in Italy between 2019 and 2021, both face-to-face and online.",
    "pdf_url": "https://arxiv.org/pdf/2104.12422v2",
    "published": "2021-04-26"
  }
}